In [ ]:
# 5.   In the RecentDelays column, the values have been entered into the DataFrame as a list. 
#      We would like each first value in its own column, each second value in its own column, and so on. 
#      If there isn't an Nth value, the value should be NaN. 
#      Expand the Series of lists into a DataFrame named delays, 
#      rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',  
'Budapest_PaRis', 'Brussels_londOn'],  
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],  
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],  
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',  
'12. Air France', '"Swiss Air"']},index=['1','2','3','4','5'])

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
delays = pd.DataFrame(df['RecentDelays'].values.tolist(), columns=['Delay_1','Delay_2','Delay_3'])
delays

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [5]:
df['RecentDelays']='delays'
df

            From_To  FlightNumber RecentDelays              Airline
1      LoNDon_paris       10045.0       delays               KLM(!)
2      MAdrid_miLAN           NaN       delays    <Air France> (12)
3  londON_StockhOlm       10065.0       delays  (British Airways. )
4    Budapest_PaRis           NaN       delays       12. Air France
5   Brussels_londOn       10085.0       delays          "Swiss Air"